                      # Simple linear Linear regression

In [3]:
#importing libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
data = pd.read_csv("D:\ML stuff\Suvajith\ML Intuition\Data\Salary_Data.csv")

In [19]:
data.head(10)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0
5              2.9  56642.0
6              3.0  60150.0
7              3.2  54445.0
8              3.2  64445.0
9              3.7  57189.0

In [28]:
data.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [11]:
data.corr()

                 YearsExperience    Salary
YearsExperience         1.000000  0.978242
Salary                  0.978242  1.000000

In [39]:
x= data.drop(['Salary'],axis=1)
y = data.Salary

    YearsExperience
0               1.1
1               1.3
2               1.5
3               2.0
4               2.2
5               2.9
6               3.0
7               3.2
8               3.2
9               3.7
10              3.9
11              4.0
12              4.0
13              4.1
14              4.5
15              4.9
16              5.1
17              5.3
18              5.9
19              6.0
20              6.8
21              7.1
22              7.9
23              8.2
24              8.7
25              9.0
26              9.5
27              9.6
28             10.3
29             10.5

In [47]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.30 ,random_state = 99)
print(x_train.head())

print('/n')

print(x_test.head())
y_train

    YearsExperience
7               3.2
22              7.9
14              4.5
6               3.0
11              4.0
/n
    YearsExperience
23              8.2
24              8.7
16              5.1
12              4.0
21              7.1

7      54445.0
22    101302.0
14     61111.0
6      60150.0
11     55794.0
13     57081.0
0      39343.0
19     93940.0
17     83088.0
28    122391.0
29    121872.0
20     91738.0
5      56642.0
4      39891.0
18     81363.0
26    116969.0
9      57189.0
8      64445.0
25    105582.0
3      43525.0
1      46205.0
Name: Salary, dtype: float64

In [48]:
from sklearn.linear_model import LinearRegression
regression = LinearRegression()
regression.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [52]:
y_pred = regression.predict(x_test)

In [50]:
print("coefficient",regression.coef_)
print("intercept",regression.intercept_)

coefficient [9181.09379833]
intercept 27485.600945605576

In [51]:
print(y_test)

print('\n')

print(y_pred)

23    113812.0
24    109431.0
16     66029.0
12     56957.0
21     98273.0
27    112635.0
10     63218.0
15     67938.0
2      37731.0
Name: Salary, dtype: float64


[102770.57009191 107361.11699107  74309.17931709  64209.97613892
  92671.36691375 115624.10140957  63291.86675909  72472.96055742
  41257.2416431 ]

In [62]:
from sklearn import metrics

print("Mean Absolute error",metrics.mean_absolute_error(y_test,y_pred))
print("Mean Absolute error",metrics.mean_squared_error(y_test,y_pred))
print("root Mean Absolute error",np.sqrt(metrics.mean_squared_error(y_test,y_pred)))
print("explained variance score",metrics.explained_variance_score(y_test,y_pred))
print("r2 score",metrics.r2_score(y_test,y_pred))

Mean Absolute error 5041.14131427393
Mean Absolute error 35631482.9590613
root Mean Absolute error 5969.211250999691
explained variance score 0.9505587505656186
r2 score 0.9494534182322683

In [66]:
regression.predict(10)

array([119296.5389289])

In [67]:
from sklearn.cross_validation import cross_val_score

C:\Users\Rajkumar\Anaconda3\lib\site-packages\sklearn\cross_validation.py:41: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [69]:

from sklearn.model_selection import cross_val_score 
regression_avg = cross_val_score(estimator = regression, X = x_train, y = y_train, cv = 5,scoring='neg_mean_absolute_error') 
print ("Cross Val Mean Absolute Error",regression_avg.mean())

from sklearn.model_selection import cross_val_score 
regression_avg = cross_val_score(estimator = regression, X = x_train, y = y_train, cv = 5,scoring='explained_variance') 
print ("Cross Val Explained Variance:",regression_avg.mean()*100)

Cross Val Mean Absolute Error -4951.922114346261
Cross Val Explained Variance: 94.07295265220658